package com.mes.jyd.delegate

/**
 *
 * Created by pandanxin on 2017/12/2.
 */
class Tag{
    fun scanTag(i: Int): String {
        return when (i) {
            1 -> "请扫物料批次条码"
            2 -> "请扫物料配送车条码"
            3 -> "请扫拣配员条码"
            4 -> "请扫配送员条码"
            5 -> "请扫签收员条码"
            6 -> "请扫人员条码"
            7 -> "请扫原批次号条码"
            8 -> "请扫货位条码"
            9 -> "请扫物料编码条码"
            10 -> "请扫仓管员条码"
            11 -> "请扫瓷组件车条码"
            12 -> "请扫客户编码条码"
            13 -> "请扫防串码条码"
            14 -> "请扫订单号条码"
            15 -> "请扫批次号条码"
            else -> ""
        }
    }
}
